---
kind: property
id: P:Autodesk.Revit.DB.Architecture.CutMarkType.CutLineType
source: html/c2a0ba96-93e2-6919-6ce5-1cf8e8fc8f45.htm
---
# Autodesk.Revit.DB.Architecture.CutMarkType.CutLineType Property

The cut line type of the cut mark.

## Syntax (C#)
```csharp
public CutLineType CutLineType { get; set; }
```

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentOutOfRangeException** - When setting this property: A value passed for an enumeration argument is not a member of that enumeration